iarsystems/ewarm-nxp-example-projects/LPC15xx/LPC15xx/EA-LPC1500/Blinky/Common/src/lpc13Axx_i2c.c
/**********************************************************************
* $Id: lpc13Axx_i2c.c 28 2014-01-27 14:45:13Z danielru $		lpc13Axx_i2c.c		2011-06-02
*//**
* @file		lpc13Axx_i2c.c
* @brief	Contains all functions support for I2C firmware library
* 			on lpc13Axx
* @version	1.0
* @date		02. June. 2011
* @author	NXP MCU SW Application Team
*
* Copyright(C) 2011, NXP Semiconductor
* All rights reserved.
*
***********************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.
* Permission to use, copy, modify, and distribute this software and its
* documentation is hereby granted, under NXP Semiconductors’
* relevant copyright in the software, without fee, provided that it
* is used in conjunction with NXP Semiconductors microcontrollers.  This
* copyright, permission, and disclaimer notice must appear in all copies of
* this code.
**********************************************************************/

/* Includes ------------------------------------------------------------------- */
#include "lpc13Axx.h"
#include "lpc13Axx_nmi.h"
#include "lpc13Axx_i2c.h"

volatile uint8_t I2CSlaveTXBuffer[I2C_BUFSIZE];
volatile uint8_t I2CSlaveRXBuffer[I2C_BUFSIZE];
volatile uint32_t I2CMonBuffer[I2C_MONBUFSIZE];

volatile uint32_t I2CStatus;

volatile uint32_t I2CInterruptCount = 0;
volatile uint32_t I2CMstRXCount = 0;
volatile uint32_t I2CMstTXCount = 0;
volatile uint32_t mstrxrdy = 0, msttxrdy = 0, mstidle = 0;
volatile uint32_t I2CSlvRXCount = 0;
volatile uint32_t I2CSlvTXCount = 0;
volatile uint32_t I2CSlvAddrCount = 0;
volatile uint32_t slvrxrdy = 0, slvtxrdy = 0;
volatile uint32_t slvaddrrcvd = 0;
volatile uint32_t I2CMonRXCount = 0;
volatile uint32_t SlaveAddr = 0;
volatile uint32_t RetryCount = 0;

/* Timeout related */
volatile uint32_t I2CSCLTimeoutCount = 0;
volatile uint32_t I2CEventTimeoutCount = 0;

/* Master related */
volatile uint32_t I2CMstIdleCount = 0;
volatile uint32_t I2CMstNACKAddrCount = 0;
volatile uint32_t I2CMstNACKTXCount = 0;
volatile uint32_t I2CARBLossCount = 0;
volatile uint32_t I2CMstSSErrCount = 0;

/* Slave related */
volatile uint32_t I2CSlvSelectedCount = 0;
volatile uint32_t I2CSlvDeselectedCount = 0;
volatile uint32_t I2CSlvNotStrCount = 0;

/* Monitor related */
volatile uint32_t I2CMonIdleCount = 0;
volatile uint32_t I2CMonOverrunCount = 0;

#if TIMEOUT_ENABLED
/*****************************************************************************
** Function name:		I2C_I2CTimeoutStatus
**
** Descriptions:		I2C interrupt handler to handle timeout status
**
** parameters:			None
** Returned value:		None
** 
*****************************************************************************/
void I2C_I2CTimeoutStatus( LPC_I2C_TypeDef *I2Cx, uint32_t active )
{
  if(active & STAT_SCLTIMEOUT) {
		I2CSCLTimeoutCount++;
		I2Cx->I2CSTAT = STAT_SCLTIMEOUT;
  }
  if(active & STAT_EVTIMEOUT) {
		I2CEventTimeoutCount++;
		I2Cx->I2CSTAT = STAT_EVTIMEOUT;
  }
}
#endif

/*****************************************************************************
** Function name:		I2C_MasterStatus
**
** Descriptions:		I2C interrupt handler to handle master status
**
** parameters:			None
** Returned value:		None
** 
*****************************************************************************/
void I2C_MasterStatus( LPC_I2C_TypeDef *I2Cx, uint32_t active )
{
  if (active & STAT_MSTARBLOSS) {
		I2CARBLossCount++;
		I2CStatus |= STAT_MSTARBLOSS;
		I2Cx->I2CSTAT = STAT_MSTARBLOSS;
		/* For debugging only. */
//	I2Cx->I2CCFG |= CFG_MONCLKSTR|CFG_MONENA);
  }
  if (active & STAT_MSTSSERR) {
		I2CMstSSErrCount++;
		I2CStatus |= STAT_MSTSSERR;
		I2Cx->I2CSTAT = STAT_MSTSSERR;
		/* For debugging only. Really bad happened if come here. */
//		I2Cx->I2CCFG = (CFG_MONCLKSTR|CFG_MONENA);
  }
  return;
}

/*****************************************************************************
** Function name:		I2C_SlaveStatus
**
** Descriptions:		I2C interrupt handler to handle slave status
**
** parameters:			None
** Returned value:		None
** 
*****************************************************************************/
void I2C_SlaveStatus( LPC_I2C_TypeDef *I2Cx, uint32_t active )
{
  if (active & STAT_SLVNOTSTR) {
		I2CSlvNotStrCount++;
		I2Cx->I2CINTENCLR = STAT_SLVNOTSTR;
  }
  if (active & STAT_SLVDESEL) {
		I2CSlvDeselectedCount++;
		I2Cx->I2CSTAT = STAT_SLVDESEL;
  }
  return;
}

#if I2C_MONITOR_MODE
/*****************************************************************************
** Function name:		I2C_MonitorStatus
**
** Descriptions:		I2C interrupt handler to handle monitor status
**
** parameters:			None
** Returned value:		None
** 
*****************************************************************************/
void I2C_MonitorStatus( LPC_I2C_TypeDef *I2Cx, uint32_t active )
{
  if (active & STAT_MONIDLE) {
		I2CMonIdleCount++;
		I2Cx->I2CSTAT = STAT_MONIDLE;
  }
  if (active & STAT_MONOVERRUN) {
		I2CMonOverrunCount++;
		I2Cx->I2CSTAT = STAT_MONOVERRUN;
  }
  return;
}
#endif

/*****************************************************************************
** Function name:		I2C_IRQHandler
**
** Descriptions:		I2C interrupt handler
**
** parameters:			None
** Returned value:		None
** 
*****************************************************************************/
void I2C_IRQHandler(void)
{
  uint32_t active = LPC_I2C->I2CINTSTAT;
  uint32_t i2cmststate = LPC_I2C->I2CSTAT & MASTER_STATE_MASK;	/* Only check Master and Slave State */
  uint32_t i2cslvstate = LPC_I2C->I2CSTAT & SLAVE_STATE_MASK;
  uint32_t i;

  if ( active ) {
		I2CInterruptCount++;
  }

#if I2C_MONITOR_MODE
	I2C_MonitorStatus(LPC_I2C, active);
#endif	
  /* If monitor mode is turned on, it needs to be the highest priority,
  otherwise, the slave TX and RX may stretch/release the clock and grab 
  the data already. When that happens, Monitor may have missed a clock already. */
  if(active & STAT_MONRDY) {
		I2CMonBuffer[I2CMonRXCount++] = LPC_I2C->MONRXDAT;
		if ( I2CMonRXCount == I2C_MONBUFSIZE ) {
			I2CMonRXCount = 0;
		}
  }

  /* The error interrupts should have higher priority too before data can be 
  processed. */  
#if TIMEOUT_ENABLED
  /* I2C timeout related interrupts. */
  I2C_I2CTimeoutStatus(LPC_I2C, active);
#endif
  
  /* master related interrupts. */
  I2C_MasterStatus(LPC_I2C, active);
	
  if ( active & STAT_MSTPEND )
  {
		LPC_I2C->I2CINTENCLR = STAT_MSTPEND;
		/* Below five states are for Master mode: IDLE, TX, RX, NACK_ADDR, NAC_TX. 
		IDLE is not under consideration for now. */
		switch ( i2cmststate )
		{
			case STAT_MSTIDLE:
			default:
				I2CMstIdleCount++;
				mstidle = 1;
			break;
	   
			case STAT_MSTRX:
				I2CMstRXCount++;
				mstrxrdy = 1;
			break;
	  
			case STAT_MSTTX:
				I2CMstTXCount++;
				msttxrdy = 1;
			break;
	  
			case STAT_MSTNACKADDR:
				I2CMstNACKAddrCount++;
			break;
	  
