iarsystems/ewarm-nxp-example-projects/LPC15xx/LPC15xx/EA-LPC1500/Blinky/Common/src/lpc13Axx_i2c.c
  NVIC_DisableIRQ(I2C_IRQn);
  NVIC_ClearPendingIRQ(I2C_IRQn);
  NVIC_EnableIRQ(I2C_IRQn);
#endif
  I2Cx->I2CCFG |= CFG_TIMEOUTENA;
}
#endif

/*****************************************************************************
** Function name:		I2C_CheckError
**
** Descriptions:		In the multi-master mode environment, error check
**						is required as arbitration error may cause program
**						to hang. In the real-world app., if error occurs, 
**						a graceful waiting period is needed before a retry occur. 
**						If retry count reaches zero, either stay in the master mode 
**						or switch to slave mode. This test has infinite retry 
**						without retry count and delay.
**						If interrupt is enabled, status is cleared inside ISR.  				
** parameters:			None
** Returned value:		Non-zero means error has occured.
** 
*****************************************************************************/
uint32_t I2C_CheckError( LPC_I2C_TypeDef *I2Cx )
{
#if I2C_INTERRUPT
  /* I2CStatus is updated inside the ISR. */
  if ( I2CStatus & ( STAT_MSTARBLOSS | STAT_MSTSSERR ) )
  {
		if ( I2CStatus & STAT_MSTARBLOSS ) {
			I2CStatus &= ~STAT_MSTARBLOSS;
		}
		if ( I2CStatus & STAT_MSTSSERR ) {
			I2CStatus &= ~STAT_MSTSSERR;
		}
		RetryCount++;
		return ( 1 );
  }
  else {
		return ( 0 );
  }
#else
  if ( I2Cx->I2CSTAT & (STAT_MSTARBLOSS | STAT_MSTSSERR) )
  {
		/* In polling mode, treat all the error related master status the same
		for now and clear all if set. Will address them individually later. */
		I2Cx->I2CSTAT = STAT_MSTARBLOSS | STAT_MSTSSERR;
		RetryCount++;
		return ( 1 );
  }
  else {
		return ( 0 );
  }	
#endif 
}

/*****************************************************************************
** Function name:		I2C_CheckIdle
**
** Descriptions:		Check idle, if the master is NOT idle, it shouldn't 
**									start the transfer.		
** parameters:			None
** Returned value:		None, if NOT IDLE, spin here forever.
** 
*****************************************************************************/
void I2C_CheckIdle( LPC_I2C_TypeDef *I2Cx )
{
#if I2C_INTERRUPT
  I2Cx->I2CINTENSET = STAT_MSTPEND;
  while(!mstidle);
  mstidle = 0;
#else
  /* Once the master is enabled, pending bit should be set, as the state should be in IDLE mode. */
  /* Pending, but not idle, spin here forever. */
  while ( (I2Cx->I2CSTAT & (STAT_MSTPEND|MASTER_STATE_MASK)) != (STAT_MSTPEND|STAT_MSTIDLE) );
#endif
  return;
}

/*****************************************************************************
** Function name:		I2C_MstSend
**
** Descriptions:		Send a block of data to the I2C port, the 
**									first parameter is the device addre, the 2nd is buffer 
**                  pointer, the 3rd is the block length.
**
** parameters:			device addr, buffer pointer, and the block length
** Returned value:		None
** 
*****************************************************************************/
void I2C_MstSend( LPC_I2C_TypeDef *I2Cx, uint32_t addr, uint8_t *tx, uint32_t Length )
{
  uint32_t i;

  I2Cx->MSTDAT = addr;
  I2Cx->MSTCTL = CTL_MSTSTART;
#if I2C_INTERRUPT
  msttxrdy = 0;
  I2Cx->I2CINTENSET = STAT_MSTPEND;
#endif
#if I2C_INTERRUPT
  for ( i = 0; i < Length; i++ ) 
  {
		while(!msttxrdy) {
			if ( I2C_CheckError(I2Cx) ) {
				I2C_CheckIdle(I2Cx);
				/* Recursive call here. Be very careful with stack over flow if come here, especially
				when the other master trys to grab the bus all the time. */
//				while ( 1 );
				I2C_MstSend( I2Cx, addr, tx, Length );
				return;
			}
		}
		msttxrdy = 0;
		I2Cx->MSTDAT = tx[i];
		I2Cx->MSTCTL = CTL_MSTCONTINUE;
		I2Cx->I2CINTENSET = STAT_MSTPEND;
  }
  
  /* Wait for the last one to go out. */
  while(!msttxrdy) {
		if ( I2C_CheckError(I2Cx) ) {
	    I2C_CheckIdle(I2Cx);
			/* Recursive call here. Be very careful with stack over flow if come here. especially
			when the other master trys to grab the bus all the time. */
//			while ( 1 );
			I2C_MstSend( I2Cx, addr, tx, Length );
			return;
		}
  }
  msttxrdy = 0;
#else
  for ( i = 0; i < Length; i++ ) 
  {
		/* Move only if TXRDY is ready */
		while (!(I2Cx->I2CSTAT & STAT_MSTPEND));
		if((I2Cx->I2CSTAT & MASTER_STATE_MASK) != STAT_MSTTX)
			while(1);
		I2Cx->MSTDAT = *tx++;
		I2Cx->MSTCTL = CTL_MSTCONTINUE;
  }
  
  /* Wait for the last one to go out. */
  while (!(I2Cx->I2CSTAT & STAT_MSTPEND));
  if((I2Cx->I2CSTAT & MASTER_STATE_MASK) != STAT_MSTTX)
		while(1);
#endif
  /* Send STOP condition. */  
  I2Cx->MSTCTL = CTL_MSTSTOP | CTL_MSTCONTINUE;
  I2C_CheckIdle(I2Cx);
  return; 
}

/*****************************************************************************
** Function name:		I2C_MstReceive
** Descriptions:		the module will receive a block of data from 
**						the I2C.
** parameters:			Device address, buffer pointer, and block length
** Returned value:		None
** 
*****************************************************************************/
void I2C_MstReceive( LPC_I2C_TypeDef *I2Cx, uint32_t addr, uint8_t *rx, uint32_t Length )
{
  uint32_t i;

  I2Cx->MSTDAT = addr;  
  I2Cx->MSTCTL = CTL_MSTSTART;
#if I2C_INTERRUPT
  mstrxrdy = 0;
  I2Cx->I2CINTENSET = STAT_MSTPEND;
#endif 
	for ( i = 0; i < Length; i++ )
	{
#if I2C_INTERRUPT
		while(!mstrxrdy)
		{
			if ( I2C_CheckError(I2Cx) ) {
				I2C_CheckIdle(I2Cx);
				/* Recursive call here. Be very careful with stack over flow if come here. especially
				when the other master trys to grab the bus all the time. */
//	    while ( 1 );
				I2C_MstReceive( I2Cx, addr, rx, Length );
				return;
			}
		}
		mstrxrdy = 0;
		*rx++ = I2Cx->MSTDAT;
		if ( i != Length -1 )
		{
			I2Cx->MSTCTL = CTL_MSTCONTINUE;
			I2Cx->I2CINTENSET = STAT_MSTPEND;
		}
#else
		/* Slave address has been sent, master receive is ready. */
		while (!(I2Cx->I2CSTAT & STAT_MSTPEND));
		if((I2Cx->I2CSTAT & MASTER_STATE_MASK) != STAT_MSTRX)
			while( 1 );
		*rx++ = I2Cx->MSTDAT;
		if ( i != Length -1 )
		{
			I2Cx->MSTCTL = CTL_MSTCONTINUE;
		}
#endif
  }
  I2Cx->MSTCTL = CTL_MSTSTOP | CTL_MSTCONTINUE;
  I2C_CheckIdle(I2Cx);
  return; 
}

/*****************************************************************************
** Function name:		I2C_MstSendRcv
**
** Descriptions:		Send a block of data to the I2C port combining master
**                      send and master recevie with repeated start in the middle.
**
** parameters:			Dev addr. TX ptr, TX length, RX ptr, and RX length.
** Returned value:		None
** 
*****************************************************************************/
void I2C_MstSendRcv( LPC_I2C_TypeDef *I2Cx, uint32_t addr, uint8_t *tx, uint32_t txlen, uint8_t *rx, uint32_t rxlen )
{
  uint32_t i;

  I2Cx->MSTDAT = addr;
  I2Cx->MSTCTL = CTL_MSTSTART;
#if I2C_INTERRUPT
  msttxrdy = mstrxrdy = 0;
  I2Cx->I2CINTENSET = STAT_MSTPEND;
#endif 
  for ( i = 0; i < txlen; i++ ) 
  {
#if I2C_INTERRUPT
		while(!msttxrdy) 
		{
			if ( I2C_CheckError(I2Cx) ) {
				I2C_CheckIdle(I2Cx);
				/* Recursive call here. Be very careful with stack over flow if come here, especially
				when the other master trys to grab the bus all the time. */
//				while ( 1 );
				I2C_MstSend( I2Cx, addr, tx, txlen );
				return;
	  	}
		}
	msttxrdy = 0;
	I2Cx->MSTDAT = *tx++;
	I2Cx->MSTCTL = CTL_MSTCONTINUE;
	I2Cx->I2CINTENSET = STAT_MSTPEND;
#else
	/* Move only if TXRDY is ready */
	while (!(I2Cx->I2CSTAT & STAT_MSTPEND));
	if((I2Cx->I2CSTAT & MASTER_STATE_MASK) != STAT_MSTTX)
	  while(1);
	I2Cx->MSTDAT = *tx++;
	I2Cx->MSTCTL = CTL_MSTCONTINUE;
#endif
  }

